In [1]:
#consistes of series
#group of series form dataframe

import pandas as pd
s1 = pd.Series(data=[1,2,3,4,5],index=['a','b','c','d','e'])

In [2]:
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
s2 = pd.Series(data=[11,22,33,44,55],index=['a','b','c','d','e'])

In [4]:
s2

a    11
b    22
c    33
d    44
e    55
dtype: int64

In [5]:
s1+s2

a    12
b    24
c    36
d    48
e    60
dtype: int64

In [7]:
s1['a']

1

In [8]:
s1['a':'d']

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
s1[0:3]

a    1
b    2
c    3
dtype: int64

In [10]:
pd.DataFrame({'A':s1,'B':s2})

   A   B
a  1  11
b  2  22
c  3  33
d  4  44
e  5  55

In [11]:
pd.DataFrame({'A':s1,'B':s2}, index=['a','b','g'])

     A     B
a  1.0  11.0
b  2.0  22.0
g  NaN   NaN

In [13]:
pd.DataFrame([s1,s2])

    a   b   c   d   e
0   1   2   3   4   5
1  11  22  33  44  55

In [14]:
s3 = pd.Series(data=[111,222],index=['a','b'])

In [15]:
s3

a    111
b    222
dtype: int64

In [16]:
df = pd.DataFrame({'A':s1,'B':s2, 'C':s3})

In [17]:
df

   A   B      C
a  1  11  111.0
b  2  22  222.0
c  3  33    NaN
d  4  44    NaN
e  5  55    NaN

In [21]:
pd.read_csv('data\house_rental_data.csv').head()

,Unnamed: 0,Sqft,Floor,TotalFloor,Bedroom,Living.Room,Bathroom,Price
0,1,1177.698,2,7,2,2,2,62000
1,2,2134.800,5,7,4,2,2,78000
2,3,1138.560,5,7,2,2,1,58000
3,4,1458.780,2,7,3,2,2,45000
4,5,967.776,11,14,3,2,2,45000